<?php

$this->layout('layouts/main') ?>

<?php
$this->start('page_content') ?>

    <h3>Сервіс агрегатор для проведення фіктивних опитувань</h3>

    <p>Необхідний сервіс, який може надати функціонал управління фіктивними (з
        попередньо визначеною кількістю голосів) опитуваннями (далі просто -
        "опитування").</p>
    <p>Користувач сервісу повинен мати можливість зайти на публічну частину
        програми, зареєструватися та створити будь-яку кількість опитувань, із
        заздалегідь проставленою кількістю відповідей на той чи інший пункт, у форматі:</p>

        <h6>Запитання:</h6>
    <ol type="1">
        <li>Відповідь 1</li>
        <li>Відповідь 2</li>
        <li>…</li>
        <li>…</li>
        <li>n. …</li>
    </ol>

    <h6>Необхідний функціонал:</h6>
<ol type="1">
    <li>Аутентифікація на сервісі.</li>
    <li>Сторінка реєстрації</li>
    <li>Сторінка логіна</li>
    <li>Розлогін</li>
    <li>Від користувача потрібен лише email та пароль.</li>
    <li>Аутентифікований користувач потрапляє до особистого кабінету.</li>
    <li>Особистий кабінет:</li>
    <ul>
    <li>Містить розділ зі списком власних опитувань.</li>
        <li>Сортування списку за “датою створення”, “заголовком”, “статусом”.</li>
        <li>CRUD для керування опитуваннями.</li>
        <li>Кожне опитування містить:</li>
        <ol type="1">
        <li>текст питання (заголовок);</li>
            <li>будь-яку кількість відповідей;</li>
            <li>кількість голосів до кожної з відповідей;</li>
            <li>статус "чернетка" або "опублікований".</li>
        </ol>
    </ul>

</ol>

<p>
    Кінцевий користувач, який використовує даний сервіс, повинен отримати доступ
    до API для отримання даних опублікованого рандомного опитування зі свого
    списку.
</p>
<p>
    Дані повинні містити:
    <ul>
        <li>заголовок</li>
        <li>пункти відповідей з кількістю голосів кожного з них.
        API тестуватимуть з використанням Postman.</li>
    </ul>
</p>
<p>
    <h6>Вимоги до реалізації:</h6>
    <ol type="1" class="">
    <li>Реалізація на чистому PHP без використання фреймворків.
    <li>Можна використовувати бібліотеки на ваш вибір.</li>
    <li>Додаток повинен бути написаний в стилі ООП.</li>
    <li>Використовуйте MVC модель для організації роботи програми.</li>
    <li>Цьому додатку не потрібна складна архітектура, намагайтеся</li>
    дотримуватися YAGNI принципу та уникнути надмірності.</li>
    <li>Верстка на Bootstrap, до дизайну особливих вимог немає.</li>
    </ol>
</p>
<p>
    <h6>Після виконання завдання необхідно:</h6>
    <ol type="1" class="m-0">
    <li>Надати посилання на git репозиторій Вашої роботи.</li>
    <li>Надати мінімально необхідну документацію у будь-якому зручному для
    читання вигляді з описом роботи API.</li>
    <li>Розгорнути на будь-якому безкоштовному хостингу, щоб можна було
    переглянути результат.</li>
    </ol>
</p>
<?php
$this->stop() ?>